package day1;

public class Task3 {
//    3. Вывести на экран слово “JAVA”, в столбик, чтобы оно повторилось 10 раз,
//    используя цикл на ваше усмотрение (for или while).
    public static void main(String[] args) {
        for (int i = 0; i < 10; i++) {
            System.out.println("JAVA");
        }
    }
}